## DataFrame

In [3]:
import pymysql
import pandas as pd

conn = pymysql.connect(
    host='47.104.31.138', port=3306, 
    user='guest', password='Guest.618',
     db='hrs', charset='utf8mb4')

dept_df = pd.read_sql('SELECT * FROM dept', conn, index_col='dno')

OperationalError: (2003, "Can't connect to MySQL server on '47.104.31.138' (timed out)")

In [ ]:
df1 = pd.read_csv('./1-10章数据集/ch2/clothing_store.csv')
df1

     type_1 type_2  buy_price  sale_price product_id
0        裤子    游泳裤        145         154    S007721
1        鞋子     凉鞋         98         101    S007156
2        鞋子     拖鞋        122         149    S002286
3        鞋子     拖鞋         55          74    S009119
4        鞋子     凉鞋         79         112    S004373
...     ...    ...        ...         ...        ...
9995     鞋子     拖鞋        123         124    S004636
9996     鞋子     拖鞋        106         113    S001560
9997     上衣     T恤         68          75    S001280
9998     裤子     长裤        113         139    S001207
9999     裤子     中裤        122         138    S002475

[10000 rows x 5 columns]

In [ ]:
df1['type_1']
df1.loc[2056, 'type_1']

'上衣'

In [ ]:
df1.loc[1000:1100]
df1.loc[1000:1100, 'type_1':'sale_price']

     type_1 type_2  buy_price  sale_price
1000     上衣     T恤        175         176
1001     上衣    羽绒服        176         183
1002     裤子     中裤        101         115
1003     鞋子     跑鞋        157         193
1004     上衣     T恤        180         189
...     ...    ...        ...         ...
1096     裤子    游泳裤        112         136
1097     鞋子     凉鞋        157         169
1098     鞋子     拖鞋        195         204
1099     裤子    游泳裤        183         190
1100     上衣     T恤         62          73

[101 rows x 4 columns]

In [ ]:
df1.query('type_1 == "上衣" and sale_price > 100')

     type_1 type_2  buy_price  sale_price product_id
7        上衣    冲锋衣        100         144    S003098
8        上衣     T恤        115         157    S006858
12       上衣    羽绒服         84         101    S006706
18       上衣    羽绒服        141         180    S009979
19       上衣    冲锋衣        111         148    S002993
...     ...    ...        ...         ...        ...
9987     上衣     T恤         71         110    S005817
9988     上衣    冲锋衣        152         164    S003621
9990     上衣     T恤        112         157    S004620
9991     上衣     T恤        110         138    S002448
9993     上衣    羽绒服        134         134    S008086

[2748 rows x 5 columns]

In [4]:
df2 = pd.read_csv('./1-10章数据集/learn_pandas.csv')
df2.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [8]:
# df2.isnull().sum()
df2.isna().sum()

School          0
Grade           0
Name            0
Gender          0
Height         17
Weight         11
Transfer       12
Test_Number     0
Test_Date       0
Time_Record     0
dtype: int64